[Killed] BlockStatement
src/calculadora.js:1:22
-function somar(a, b) {
-  return a + b;
-}
+function somar(a, b) {}
 
 function subtrair(a, b) {
killedBy: Calculadora soma dois números positivos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: undefined

[Killed] ArithmeticOperator
src/calculadora.js:2:10
 function somar(a, b) {
-  return a + b;
+  return a - b;
 }
 
killedBy: Calculadora soma dois números positivos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: -1

[Killed] BlockStatement
src/calculadora.js:5:25
   return a + b;
 }
 
-function subtrair(a, b) {
-  return a - b;
-}
+function subtrair(a, b) {}
 
 function dividir(a, b) {
killedBy: Calculadora subtrai dois números positivos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 7
Received: undefined

[Killed] ArithmeticOperator
src/calculadora.js:6:10
 }
 
 function subtrair(a, b) {
-  return a - b;
+  return a + b;
 }
 
killedBy: Calculadora subtrai dois números positivos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 7
Received: 13

[Killed] BlockStatement
src/calculadora.js:9:24
   return a - b;
 }
 
-function dividir(a, b) {
-  if (b === 0) {
-    throw new Error('Divisão por zero não permitida');
-  }
-  return a / b;
-}
+function dividir(a, b) {}
 
 function multiplicar(a, b) {
killedBy: Calculadora divide dois números positivos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: undefined

[Killed] ConditionalExpression
src/calculadora.js:10:7
 }
 
 function dividir(a, b) {
-  if (b === 0) {
+  if (true) {
     throw new Error('Divisão por zero não permitida');
   }
killedBy: Calculadora divide dois números positivos
statusReason: Error: Divisão por zero não permitida

[Killed] ConditionalExpression
src/calculadora.js:10:7
 }
 
 function dividir(a, b) {
-  if (b === 0) {
+  if (false) {
     throw new Error('Divisão por zero não permitida');
   }
killedBy: Calculadora lança erro ao dividir por zero
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Divisão por zero não permitida"

Received function did not throw

[Killed] BlockStatement
src/calculadora.js:16:28
   return a / b;
 }
 
-function multiplicar(a, b) {
-  return a * b;
-}
+function multiplicar(a, b) {}
 
 module.exports = { somar, subtrair, dividir, multiplicar };
killedBy: Calculadora multiplica dois números positivos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: undefined

[Killed] ArithmeticOperator
src/calculadora.js:17:10
 }
 
 function multiplicar(a, b) {
-  return a * b;
+  return a / b;
 }
 
killedBy: Calculadora multiplica dois números positivos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: 2
